nxp-imx/linux-imx/arch/arm/boot/dts/nxp/imx/imxrt10xx-padctrl.h
/* SPDX-License-Identifier: (GPL-2.0+ OR MIT) */
/*
 * Copyright (C) 2023 Emcraft Systems
 * Author(s): Vladimir Skvortsov <vskvortsov@emcraft.com>
 */

#ifndef __DTS_IMXRT10XX_PADCTRL_H
#define __DTS_IMXRT10XX_PADCTRL_H

#define MXRT10XX_PAD_HYS		(1 << 16)

#define MXRT10XX_PAD_PUS(n)		((n & 0x3) << 14)
#define MXRT10XX_PAD_PUS_100K_PD	MXRT10XX_PAD_PUS(0)
#define MXRT10XX_PAD_PUS_47K_PU		MXRT10XX_PAD_PUS(1)
#define MXRT10XX_PAD_PUS_100K_PU	MXRT10XX_PAD_PUS(2)
#define MXRT10XX_PAD_PUS_22K_PU		MXRT10XX_PAD_PUS(3)

#define MXRT10XX_PAD_PUE		(1 << 13)
#define MXRT10XX_PAD_PKE		(1 << 12)
#define MXRT10XX_PAD_ODE		(1 << 11)

#define MXRT10XX_PAD_SPEED(n)		((n & 0x3) << 6)
#define MXRT10XX_PAD_SPEED_50MHZ	MXRT10XX_PAD_SPEED(0)
#define MXRT10XX_PAD_SPEED_100MHZ_1	MXRT10XX_PAD_SPEED(1)
#define MXRT10XX_PAD_SPEED_100MHZ_2	MXRT10XX_PAD_SPEED(2)
#define MXRT10XX_PAD_SPEED_200MHZ	MXRT10XX_PAD_SPEED(3)

#define MXRT10XX_PAD_DSE(n)		((n & 0x7) << 3)
#define MXRT10XX_PAD_DSE_DISABLED	MXRT10XX_PAD_DSE(0)
#define MXRT10XX_PAD_DSE_150_OHM_1V8	MXRT10XX_PAD_DSE(1)
#define MXRT10XX_PAD_DSE_75_OHM_1V8	MXRT10XX_PAD_DSE(2)
#define MXRT10XX_PAD_DSE_50_OHM_1V8	MXRT10XX_PAD_DSE(3)
#define MXRT10XX_PAD_DSE_37_OHM_1V8	MXRT10XX_PAD_DSE(4)
#define MXRT10XX_PAD_DSE_30_OHM_1V8	MXRT10XX_PAD_DSE(5)
#define MXRT10XX_PAD_DSE_25_OHM_1V8	MXRT10XX_PAD_DSE(6)
#define MXRT10XX_PAD_DSE_21_OHM_1V8	MXRT10XX_PAD_DSE(7)

#define MXRT10XX_PAD_DSE_260_OHM_3V3	MXRT10XX_PAD_DSE(1)
#define MXRT10XX_PAD_DSE_130_OHM_3V3	MXRT10XX_PAD_DSE(2)
#define MXRT10XX_PAD_DSE_87_OHM_3V3	MXRT10XX_PAD_DSE(3)
#define MXRT10XX_PAD_DSE_65_OHM_3V3	MXRT10XX_PAD_DSE(4)
#define MXRT10XX_PAD_DSE_52_OHM_3V3	MXRT10XX_PAD_DSE(5)
#define MXRT10XX_PAD_DSE_43_OHM_3V3	MXRT10XX_PAD_DSE(6)
#define MXRT10XX_PAD_DSE_37_OHM_3V3	MXRT10XX_PAD_DSE(7)

#define MXRT10XX_PAD_SRE_SLOW		(0 << 0)
#define MXRT10XX_PAD_SRE_FAST		(1 << 0)

#define IMX_PAD_SION	0x40000000

#define MXRT10XX_PAD_CFG_UART		(MXRT10XX_PAD_PKE | MXRT10XX_PAD_PUS_100K_PD | \
					 MXRT10XX_PAD_SPEED_100MHZ_2 |	\
					 MXRT10XX_PAD_DSE_43_OHM_3V3)

#define MXRT10XX_PAD_CFG_GPIO		(MXRT10XX_PAD_PUS_100K_PU | MXRT10XX_PAD_PUE | \
					 MXRT10XX_PAD_PKE | MXRT10XX_PAD_DSE_52_OHM_3V3 | \
					 MXRT10XX_PAD_SPEED_100MHZ_1 | MXRT10XX_PAD_SRE_FAST)

#define MXRT10XX_PAD_CFG_ENET_TX	(MXRT10XX_PAD_DSE_52_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_200MHZ |		\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_PUS_22K_PU |		\
					 MXRT10XX_PAD_SRE_FAST)

#define MXRT10XX_PAD_CFG_ENET_RX	(MXRT10XX_PAD_DSE_DISABLED |		\
					 MXRT10XX_PAD_SPEED_200MHZ |		\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_PUS_22K_PU)

#define MXRT10XX_PAD_CFG_ENET_MDIO	(MXRT10XX_PAD_DSE_52_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_200MHZ |		\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_PUS_22K_PU |		\
					 MXRT10XX_PAD_SRE_FAST)

#define MXRT10XX_PAD_CFG_ENET_CLK_OUT	(IMX_PAD_SION |				\
					 MXRT10XX_PAD_DSE_65_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_200MHZ |		\
					 MXRT10XX_PAD_SRE_FAST)

#define MXRT10XX_PAD_CFG_ENET_CLK_IN	(MXRT10XX_PAD_DSE_DISABLED |		\
					 MXRT10XX_PAD_SPEED_200MHZ |		\
					 MXRT10XX_PAD_PUS_22K_PU)

#define MXRT10XX_PAD_CFG_SDHC		(MXRT10XX_PAD_SRE_FAST |		\
					 MXRT10XX_PAD_DSE_87_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_100MHZ_1 |		\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PUS_22K_PU |		\
					 MXRT10XX_PAD_HYS)

#define MXRT10XX_PAD_CFG_SDHC_CLK	(MXRT10XX_PAD_SRE_FAST |		\
					 MXRT10XX_PAD_DSE_43_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_100MHZ_1 |		\
					 MXRT10XX_PAD_HYS)

#define MXRT10XX_PAD_CFG_USB_OTG_ID	(MXRT10XX_PAD_SRE_FAST |		\
					 MXRT10XX_PAD_DSE_87_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_100MHZ_1 |		\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PUS_47K_PU |		\
					 MXRT10XX_PAD_HYS)

#define MXRT10XX_PAD_CFG_USB_OTG_OC	(MXRT10XX_PAD_SRE_SLOW |		\
					 MXRT10XX_PAD_DSE_43_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_100MHZ_2 |		\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PUS_100K_PU |		\
					 MXRT10XX_PAD_HYS)

#define MXRT10XX_PAD_CFG_I2C		(IMX_PAD_SION |				\
					 MXRT10XX_PAD_HYS |			\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PUS_100K_PU |		\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_ODE |			\
					 MXRT10XX_PAD_SPEED_100MHZ_2 |		\
					 MXRT10XX_PAD_DSE_43_OHM_3V3 |		\
					 MXRT10XX_PAD_SRE_FAST)

#define MXRT10XX_PAD_CFG_SPI		(MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_PUS_100K_PD |		\
					 MXRT10XX_PAD_SPEED_100MHZ_2 |		\
					 MXRT10XX_PAD_DSE_43_OHM_3V3)

#define MXRT10XX_PAD_CFG_LCD		(MXRT10XX_PAD_HYS |			\
					 MXRT10XX_PAD_PUS_100K_PU |		\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_SPEED_100MHZ_2 |		\
					 MXRT10XX_PAD_DSE_43_OHM_3V3)
#define MXRT10XX_PAD_CFG_FLEXSPI	(IMX_PAD_SION |				\
					 MXRT10XX_PAD_SRE_FAST |		\
					 MXRT10XX_PAD_DSE_43_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_200MHZ |		\
					 MXRT10XX_PAD_PKE)

#define MXRT10XX_PAD_CFG_FLEXSPI_DQS	(IMX_PAD_SION |				\
					 MXRT10XX_PAD_SRE_FAST |		\
					 MXRT10XX_PAD_DSE_43_OHM_3V3 |		\
					 MXRT10XX_PAD_SPEED_200MHZ |		\
					 MXRT10XX_PAD_PKE |			\
					 MXRT10XX_PAD_PUE |			\
					 MXRT10XX_PAD_PUS_100K_PD |		\
					 MXRT10XX_PAD_HYS)
#endif
